app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def current_user
    return unless session[:user_id]
    @current_user ||= User.find(session[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def authenticate_user
    unless session[:user_id]
        redirect_to(:controller => 'main', :action => 'login')
        return false
    else
      # set current_user by the current user object
      @current_user = User.find session[:user_id]