app/controllers/main_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "fakey@fke.com"], ["LIMIT", 1]]
---
    def login_attempt
        authorized_user = User.authenticate(params[:email],params[:password])
        if authorized_user
            session[:user_id] = authorized_user.id
            if authorized_user.user_type == "editor"
                redirect_to('/editor/review')
            else
                if !authorized_user.services.present? and authorized_user.waitlisted