app/controllers/users_controller.rb

    def create
        params[:user_type] = "business"
        @user = User.new(user_params)
        user_saved = @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "encrypted_password", "salt", "created_at", "updated_at", "admin", "waitlisted", "approved", "user_type") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def save_information
        @current_user = current_user
        if !current_user
             render json: {'status': 'failure', 'message': 'No user logged in'}
        end
        current_user.services = information_params[:services]
        current_user.details = information_params[:details]
        current_user.rss = information_params[:rss]
        user_saved = @current_user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "encrypted_password", "salt", "created_at", "updated_at", "admin", "waitlisted", "approved", "user_type", "editing_description", "previous_work") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "users" SET "services" = ?, "details" = ?, "rss" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["services", "setup, edit, distribute, other"], ["details", "asd"], ["rss", "dsa"], ["updated_at", "2018-12-24 04:45:46.700093"], ["id", 18]]

    def create_editor
        params[:user_type] = "editor"
        @user = User.new(user_params)
        user_saved = @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "encrypted_password", "salt", "created_at", "updated_at", "admin", "waitlisted", "approved", "user_type", "editing_description", "previous_work") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)