app/models/user.rb

    def self.authenticate(email="", login_password="")
        user = User.find_by_email(email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "fakey@fke.com"], ["LIMIT", 1]]